# LoadComponent Class

---
An object that represents a load combination component.
SystemObject Autodesk.Revit.DB.StructureLoadComponent
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class LoadComponent : IDisposable

    Public Class LoadComponent
    	Implements IDisposable

    public ref class LoadComponent : IDisposable

    type LoadComponent =
        class
            interface IDisposable
        end
The LoadComponent type exposes the following members.
| Name| Description
---|---|---
| LoadComponent|  Constructs a new instance of a LoadComponent. The load case or combination id. The load case or combination factor.
Top
| Name| Description
---|---|---
| Factor|  Load component factor.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| LoadCaseOrCombinationId|  Load case or combination id.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the LoadComponent
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Structure Namespace